//შექმენით სია ,სადაც მოათავსებთ მხოლოდ სახელებს,თქვენი დავალებაა რომ კონსოლში გამოიტანოთ ყველა ის სახელი რომელიც იწყება ასო ბგერა "ა" ზე ასევე მთავრდება ასო ბგერა "ი" ზე ასევე სახელის სიგრძე არის 5 ზუსტად 5 ტოლი.
let names = ['ანა', 'ბექა', 'გიორგი', 'მარიამი', 'თამარი', 'ლაშა', 'ნინო', 'დავითი', 'ეკატერინე', 'ზურა', 'სოფო', 'ალექსი', 'ირაკლი', 'აკაკი', 'თეონა']

for(let i = 0;i < names.length;i++) {
    if(names[i][0] === 'ა' && names[i][names[i].length -1] === 'ი' && names[i].length === 5) {
        console.log(names[i])
    }
}