//შექმენით ფუნქცია რომელსაც გადაეცემა სია. ამ სიაში უნდა იყოს სიები. და თითოეულ სიაში უნდა იყოს რამე სახელი და მეორე არგუმენტად რიცხვი. და ამ ფუნქციამ უნდა დააბრუნოს ისეთი სიები, რომლებშიც პირველ ინდექსზე მყოფი რიცხვის მნიშვნელობა იქნება 18-ზე მეტი.
function filter(text) {
    let result = []
    for (let i = 0; i < text.length; i++) {
        if (text[i][0] > 18) {
            result.push(text[i])
        }
    }
    return result
}

console.log(filter([[20, 'nika'], [15, 'luka'], [22, 'lika'], [17, 'ana']]))