print()
#გამოჰყავს მომხმარებლის ეკრანზე ის რასაც ჩვენ მასში ჩავწერთ
input()
#აძლევს საშუალებას მომხმარებელს, რომ რაღაც მონაცემი შემოიტანოს
str()
#მას შეუძლია რაიმე მონაცემი გადააქციოს სტრინგად
int()
#მას შეუძლია რაიმე მონაცემი გადააქციოს ინტეჯერად
float()
#მას შეუძლია რაიმე მონაცემი გადააქციოს ათწილადად
list()
#გამოიყენება იმისთვის, რომ ნებისმიერი მონაცემთა სტრუქტურა გარდაიქმნას სიად
range()
#მას შეუძლია შექმნას რაიმე თანმიმდევრობა
type()
#გამოიყენება ობიექტის ტიპის დასადგენად
sum()
#გამოიყენება რიცხვების სიიდან ან სხვაგვარი მონაცემების სტრუქტურიდან ელემენტების ჯამის დასათვლელად