//გააკეთეთ ქულების შემფასებელი. ცვლადში შეინახავთ ასოს (A, B, C, D, E, F) და თუ ცვლადის მნიშვნელობა არის
    //A - საუკეთესო ქულა, ყოჩაღ
    //B - კარგი ქულაა
    //C - საშუალო შედეგი
    //D - ცუდი შედეგია, ეცადე უკეთესად
    //F - ჩაიჭერი
//სხვა შემთხვევაში - ასეთი შეფასება არ არსებობს.
//გამოიტანეთ კონსოლში შესაბამისი მნიშვნელობები.
let grade = 'A'

switch (grade) {
    case 'A':
        console.log('საუკეთესო ქულა, ყოჩაღ')
        break
    case 'B':
        console.log('კარგი ქულაა')
        break
    case 'C':
        console.log('საშუალო შედეგი')
        break
    case 'D':
        console.log('ცუდი შედეგია, ეცადე უკეთესად')
        break
    case 'F':
        console.log('ჩაიჭერი')
        break
    default:
        console.log('ასეთი შეფასება არ არსებობს.')
}