//შექმენი პროგრამა, რომელიც მომხმარებლის მიერ შეყვანილ ნებისმიერ ნატურალურ რიცხვს დაიყვანს 1-მდე. იმ შემთხვევაში თუ რიცხვი ლუწია მაშინ ორზე უნდა გაყოს. კენტის შემთხვევაში გაამრავლოს 3-ზე და 1 დაუმატოს. თქვენი მიზანია დაითვალოთ რამდენი ნაბიჯი დასჭირდათ 1-მდე მისასვლელად
let number = Number(prompt("შეიყვანე ნატურალური რიცხვი: "))
let steps = 0

do {
    if (number % 2 === 0) {
        number = number / 2
    } else {
        number = number * 3 + 1
    }
    steps += 1
} while (number !== 1)

console.log(steps)